#### data preprocessing could use as ETA tool

In [78]:
import pandas as pd

In [79]:
names=['hassan', 'ahmed', 'ali']
ages=[30,22,28]

In [80]:

# create lists 
names=[]
ages=[]
teams=[]
salaries=[]
# Open the file for reading
with open("Downloads/data.txt", 'r') as file:
 lines=file.readlines()
 lines=lines[1:]
 for line in lines:
    line.strip(" ")
    name,age,team,salary1,salary2=line.split(',')
    names.append(name)
    ages.append(age)
    teams.append(team)
    salaries.append(int(salary1.replace('$',"")+salary2))
    
names, ages,teams,salaries

(['Alice Johnson',
  'Bob Smith',
  'Charlie Brown',
  'Diana Prince',
  'Ethan Hunt',
  'Fiona Gallagher',
  'George Washington',
  'Hannah Montana',
  'Ian Malcolm',
  'Jessica Rabbit',
  'Kevin Bacon',
  'Laura Croft',
  'Mike Wazowski',
  'Nina Simone',
  'Oliver Twist',
  'Pamela Anderson',
  'Quincy Adams',
  'Rachel Green',
  'Sammy Davis',
  'Tina Fey',
  'Ursula Andress',
  'Victor Frankenstein',
  'Wanda Maximoff',
  'Xena Warrior',
  'Yasmine Bleeth',
  'Zach Morris'],
 [' 28',
  ' 34',
  ' 22',
  ' 30',
  ' 27',
  ' 24',
  ' 31',
  ' 29',
  ' 35',
  ' 26',
  ' 33',
  ' 25',
  ' 32',
  ' 30',
  ' 21',
  ' 36',
  ' 29',
  ' 28',
  ' 34',
  ' 27',
  ' 33',
  ' 30',
  ' 26',
  ' 35',
  ' 24',
  ' 31'],
 [' Eagles',
  ' Hawks',
  ' Falcons',
  ' Titans',
  ' Panthers',
  ' Bears',
  ' Rangers',
  ' Dolphins',
  ' Sharks',
  ' Lions',
  ' Giants',
  ' Raiders',
  ' Cougars',
  ' Warriors',
  ' Jets',
  ' Thunder',
  ' Knights',
  ' Wolves',
  ' Bulldogs',
  ' Outlaws',
  ' Spartans',
  ' Beavers',
  ' Panthers',
  ' Titans',
  ' Eagles',
  ' Hawks'],
 [65000,
  70000,
  55000,
  75000,
  60000,
  50000,
  80000,
  68000,
  72000,
  58000,
  78000,
  66000,
  74000,
  67000,
  52000,
  90000,
  62000,
  65000,
  71000,
  57000,
  79000,
  73000,
  59000,
  81000,
  54000,
  76000])

In [81]:
import numpy as np
np.mean(salaries)

67576.92307692308

In [104]:
for team in teams:
   team.lstrip() 
teams

[' Eagles',
 ' Hawks',
 ' Falcons',
 ' Titans',
 ' Panthers',
 ' Bears',
 ' Rangers',
 ' Dolphins',
 ' Sharks',
 ' Lions',
 ' Giants',
 ' Raiders',
 ' Cougars',
 ' Warriors',
 ' Jets',
 ' Thunder',
 ' Knights',
 ' Wolves',
 ' Bulldogs',
 ' Outlaws',
 ' Spartans',
 ' Beavers',
 ' Panthers',
 ' Titans',
 ' Eagles',
 ' Hawks']

In [124]:
total=0
count=0
for salary,team in zip(teams,salaries):
    if team ==' Eagles':
        total+=salary
        count+=1
total/count

ZeroDivisionError: division by zero

In [84]:
my_dict = {}

for team in teams:
    key =team
    
    if key not in my_dict.keys():
         my_dict[team]=1
    else:
         my_dict[team]+=1
print(my_dict)

{' Eagles': 2, ' Hawks': 2, ' Falcons': 1, ' Titans': 2, ' Panthers': 2, ' Bears': 1, ' Rangers': 1, ' Dolphins': 1, ' Sharks': 1, ' Lions': 1, ' Giants': 1, ' Raiders': 1, ' Cougars': 1, ' Warriors': 1, ' Jets': 1, ' Thunder': 1, ' Knights': 1, ' Wolves': 1, ' Bulldogs': 1, ' Outlaws': 1, ' Spartans': 1, ' Beavers': 1}

In [85]:
team1 = list(set(teams))
    
# Count the frequency of each team 
team_count = {}
for team in team1:
         team_count[team] = teams.count(team)
 
print(team_count)

{' Eagles': 2, ' Outlaws': 1, ' Beavers': 1, ' Jets': 1, ' Titans': 2, ' Dolphins': 1, ' Wolves': 1, ' Lions': 1, ' Bulldogs': 1, ' Spartans': 1, ' Knights': 1, ' Thunder': 1, ' Cougars': 1, ' Rangers': 1, ' Hawks': 2, ' Sharks': 1, ' Giants': 1, ' Warriors': 1, ' Raiders': 1, ' Panthers': 2, ' Bears': 1, ' Falcons': 1}

### series

In [86]:
series=pd.Series([1,2,3,45,56])
series

0     1
1     2
2     3
3    45
4    56
dtype: int64

#### attributes

In [87]:
series.index,series.values,series.size, series.shape, series.dtype

(RangeIndex(start=0, stop=5, step=1),
 array([ 1,  2,  3, 45, 56], dtype=int64),
 5,
 (5,),
 dtype('int64'))

##### all values could have the same index
##### the values could be in the different data typ

#### methods from numpy

In [88]:
series.sum(), series.mean(), series.median(), series.var(), series.std()

(107, 21.4, 3.0, 721.3, 26.857028875138067)

In [89]:
series.head() , series.tail() , series.sample(5)

(0     1
 1     2
 2     3
 3    45
 4    56
 dtype: int64,
 0     1
 1     2
 2     3
 3    45
 4    56
 dtype: int64,
 1     2
 2     3
 4    56
 3    45
 0     1
 dtype: int64)

In [90]:
series.describe()

count     5.000000
mean     21.400000
std      26.857029
min       1.000000
25%       2.000000
50%       3.000000
75%      45.000000
max      56.000000
dtype: float64

In [91]:
series=pd.Series(['a', 'c', 'd','a'])
series.describe()

count     4
unique    3
top       a
freq      2
dtype: object

In [92]:
df = pd.DataFrame(
    {'name': ['ail', 'ahmed', 'sanaa', 'mody'],
     'age': [33, 44, 55, 66]}
)

df.describe()

             age
count   4.000000
mean   49.500000
std    14.200939
min    33.000000
25%    41.250000
50%    49.500000
75%    57.750000
max    66.000000

In [97]:
df.describe(include='all')

       name        age
count     4   4.000000
unique    4        NaN
top     ail        NaN
freq      1        NaN
mean    NaN  49.500000
std     NaN  14.200939
min     NaN  33.000000
25%     NaN  41.250000
50%     NaN  49.500000
75%     NaN  57.750000
max     NaN  66.000000

In [98]:
df.describe(include='object')

       name
count     4
unique    4
top     ail
freq      1

In [94]:
ds=pd.Series([1,2,3,4,5,6])

In [95]:
def cat(x):
    if x>=5:
        return 'greater or equal'
    else:
        return 'smaller'
ds.apply(cat)

0             smaller
1             smaller
2             smaller
3             smaller
4    greater or equal
5    greater or equal
dtype: object

In [101]:
catg=lambda x:'greater or equal' if x>=5 else 'smaller'

In [102]:
ds.apply(catg)

0             smaller
1             smaller
2             smaller
3             smaller
4    greater or equal
5    greater or equal
dtype: object

In [103]:
ds.apply(lambda x:'greater or equal' if x>=5 else 'smaller')

0             smaller
1             smaller
2             smaller
3             smaller
4    greater or equal
5    greater or equal
dtype: object

In [100]:
add=lambda x,y: x+y
add(2,3)

5